# ExportLineweightInfo Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExportLineweightInfo Constructor
ExportLineweightInfo Class See Also
---
Constructs a new default ExportLineweightInfo.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public ExportLineweightInfo()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
ExportLineweightInfo()
```

# See Also
ExportLineweightInfo Class
ExportLineweightInfo Overload
Autodesk.Revit.DB Namespace